server/test/jmeter/results/soak_smoke_5min.log
2026-04-08 23:02:33,739 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-04-08 23:02:33,754 INFO o.a.j.JMeter: Loading user properties from: D:\Document\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\user.properties
2026-04-08 23:02:33,755 INFO o.a.j.JMeter: Loading system properties from: D:\Document\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\system.properties
2026-04-08 23:02:33,766 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-04-08 23:02:33,767 INFO o.a.j.JMeter: Version 5.6.3
2026-04-08 23:02:33,767 INFO o.a.j.JMeter: java.version=1.8.0_202
2026-04-08 23:02:33,767 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-04-08 23:02:33,767 INFO o.a.j.JMeter: os.name=Windows 10
2026-04-08 23:02:33,767 INFO o.a.j.JMeter: os.arch=amd64
2026-04-08 23:02:33,767 INFO o.a.j.JMeter: os.version=10.0
2026-04-08 23:02:33,767 INFO o.a.j.JMeter: file.encoding=GBK
2026-04-08 23:02:33,767 INFO o.a.j.JMeter: java.awt.headless=true
2026-04-08 23:02:33,768 INFO o.a.j.JMeter: Max memory     =1073741824
2026-04-08 23:02:33,768 INFO o.a.j.JMeter: Available Processors =16
2026-04-08 23:02:33,775 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-04-08 23:02:33,776 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-04-08 23:02:33,777 INFO o.a.j.JMeter: JMeterHome=D:\Document\apache-jmeter-5.6.3\apache-jmeter-5.6.3
2026-04-08 23:02:33,777 INFO o.a.j.JMeter: user.dir  =D:\Document\MyCodeProject\MoocHub
2026-04-08 23:02:33,777 INFO o.a.j.JMeter: PWD       =D:\Document\MyCodeProject\MoocHub
2026-04-08 23:02:33,778 INFO o.a.j.JMeter: IP: 192.168.10.2 Name: DESKTOP-RTLSVD5 FullName: DESKTOP-RTLSVD5
2026-04-08 23:02:33,812 INFO o.a.j.s.FileServer: Default base='D:\Document\MyCodeProject\MoocHub'
2026-04-08 23:02:33,815 INFO o.a.j.s.FileServer: Set new base='D:\Document\MyCodeProject\MoocHub\server\test\jmeter'
2026-04-08 23:02:33,958 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-04-08 23:02:33,977 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-04-08 23:02:33,982 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-04-08 23:02:33,988 INFO o.a.j.s.SaveService: Loading file: server\test\jmeter\scenario6_soak_mixed_rw_5min.jmx
2026-04-08 23:02:34,064 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-08 23:02:34,064 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-08 23:02:34,064 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-08 23:02:34,064 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-04-08 23:02:34,064 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-04-08 23:02:34,064 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-04-08 23:02:34,406 INFO o.a.j.JMeter: Creating summariser <summary>
2026-04-08 23:02:34,417 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-04-08 23:02:34,418 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-04-08 23:02:34,418 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-04-08 23:02:34,423 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-04-08 23:02:34,423 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-04-08 23:02:34,708 INFO o.a.j.JMeter: Running test (1775660554707)
2026-04-08 23:02:34,760 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 稳定性测试 - 50 并发 - 5 分钟
2026-04-08 23:02:34,760 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group 稳定性测试 - 50 并发 - 5 分钟.
2026-04-08 23:02:34,760 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-04-08 23:02:34,760 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=50 ramp-up=30 delayedStart=false
2026-04-08 23:02:34,819 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-04-08 23:02:34,820 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-04-08 23:02:34,913 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-1
2026-04-08 23:02:34,917 INFO o.a.j.s.FileServer: Stored: data/videos.csv
2026-04-08 23:02:34,951 INFO o.a.j.s.FileServer: Stored: data/users.csv
2026-04-08 23:02:35,171 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = DESKTOP-RTLSVD5
2026-04-08 23:02:35,178 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-04-08 23:02:35,180 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-04-08 23:02:35,180 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-04-08 23:02:35,180 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-04-08 23:02:35,180 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-04-08 23:02:35,362 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    1.5/s Avg:   116 Min:   116 Max:   116 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2026-04-08 23:02:35,510 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-2
2026-04-08 23:02:36,107 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-3
2026-04-08 23:02:36,702 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-4
2026-04-08 23:02:37,299 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-5
2026-04-08 23:02:37,902 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-6
2026-04-08 23:02:38,499 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-7
2026-04-08 23:02:39,095 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-8
2026-04-08 23:02:39,694 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-9
2026-04-08 23:02:40,294 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-10
2026-04-08 23:02:40,898 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-11
2026-04-08 23:02:41,497 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-12
2026-04-08 23:02:42,094 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-13
2026-04-08 23:02:42,694 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-14
2026-04-08 23:02:43,303 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-15
2026-04-08 23:02:43,891 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-16
2026-04-08 23:02:44,492 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-17
2026-04-08 23:02:45,105 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-18
2026-04-08 23:02:45,686 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-19
2026-04-08 23:02:46,287 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-20
2026-04-08 23:02:46,888 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-21
2026-04-08 23:02:47,485 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-22
2026-04-08 23:02:48,086 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-23
2026-04-08 23:02:48,686 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-24
2026-04-08 23:02:49,285 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-25
2026-04-08 23:02:49,881 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-26
2026-04-08 23:02:50,480 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-27
2026-04-08 23:02:51,080 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-28
2026-04-08 23:02:51,679 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-29
2026-04-08 23:02:52,278 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-30
2026-04-08 23:02:52,876 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-31
2026-04-08 23:02:53,476 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-32
2026-04-08 23:02:54,076 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-33
2026-04-08 23:02:54,671 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-34
2026-04-08 23:02:55,272 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-35
2026-04-08 23:02:55,869 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-36
2026-04-08 23:02:56,475 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-37
2026-04-08 23:02:57,070 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-38
2026-04-08 23:02:57,671 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-39
2026-04-08 23:02:58,264 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-40
2026-04-08 23:02:58,865 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-41
2026-04-08 23:02:59,462 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-42
2026-04-08 23:03:00,012 INFO o.a.j.r.Summariser: summary +   2543 in 00:00:25 =  103.2/s Avg:     6 Min:     2 Max:   110 Err:     0 (0.00%) Active: 42 Started: 42 Finished: 0
2026-04-08 23:03:00,013 INFO o.a.j.r.Summariser: summary =   2544 in 00:00:25 =  100.5/s Avg:     6 Min:     2 Max:   116 Err:     0 (0.00%)
2026-04-08 23:03:00,061 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-43
2026-04-08 23:03:00,659 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-44
2026-04-08 23:03:01,277 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-45
2026-04-08 23:03:01,857 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-46
2026-04-08 23:03:02,459 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-47
2026-04-08 23:03:03,055 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-48
2026-04-08 23:03:03,656 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-49
2026-04-08 23:03:04,255 INFO o.a.j.t.JMeterThread: Thread started: 稳定性测试 - 50 并发 - 5 分钟 1-50
2026-04-08 23:03:30,000 INFO o.a.j.r.Summariser: summary +   6908 in 00:00:30 =  230.4/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-04-08 23:03:30,000 INFO o.a.j.r.Summariser: summary =   9452 in 00:00:55 =  170.9/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)
2026-04-08 23:04:00,014 INFO o.a.j.r.Summariser: summary +   6950 in 00:00:30 =  231.6/s Avg:     6 Min:     2 Max:    72 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-04-08 23:04:00,015 INFO o.a.j.r.Summariser: summary =  16402 in 00:01:25 =  192.3/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)
2026-04-08 23:04:30,001 INFO o.a.j.r.Summariser: summary +   6954 in 00:00:30 =  231.9/s Avg:     6 Min:     3 Max:    37 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-04-08 23:04:30,002 INFO o.a.j.r.Summariser: summary =  23356 in 00:01:55 =  202.6/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)
2026-04-08 23:05:00,008 INFO o.a.j.r.Summariser: summary +   6958 in 00:00:30 =  231.9/s Avg:     5 Min:     2 Max:    27 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-04-08 23:05:00,009 INFO o.a.j.r.Summariser: summary =  30314 in 00:02:25 =  208.6/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)
2026-04-08 23:05:30,035 INFO o.a.j.r.Summariser: summary +   6930 in 00:00:30 =  230.8/s Avg:     7 Min:     2 Max:    83 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-04-08 23:05:30,035 INFO o.a.j.r.Summariser: summary =  37244 in 00:02:55 =  212.4/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)
2026-04-08 23:06:00,038 INFO o.a.j.r.Summariser: summary +   6953 in 00:00:30 =  231.8/s Avg:     6 Min:     3 Max:    34 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-04-08 23:06:00,038 INFO o.a.j.r.Summariser: summary =  44197 in 00:03:25 =  215.2/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)
2026-04-08 23:06:30,006 INFO o.a.j.r.Summariser: summary +   6957 in 00:00:30 =  232.1/s Avg:     6 Min:     2 Max:    42 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-04-08 23:06:30,007 INFO o.a.j.r.Summariser: summary =  51154 in 00:03:55 =  217.4/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)
2026-04-08 23:07:00,021 INFO o.a.j.r.Summariser: summary +   6956 in 00:00:30 =  231.8/s Avg:     6 Min:     2 Max:    31 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-04-08 23:07:00,021 INFO o.a.j.r.Summariser: summary =  58110 in 00:04:25 =  219.0/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)
2026-04-08 23:07:30,016 INFO o.a.j.r.Summariser: summary +   6950 in 00:00:30 =  231.7/s Avg:     7 Min:     2 Max:    59 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-04-08 23:07:30,017 INFO o.a.j.r.Summariser: summary =  65060 in 00:04:55 =  220.3/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)
2026-04-08 23:07:34,595 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-24
2026-04-08 23:07:34,597 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-13
2026-04-08 23:07:34,597 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-27
2026-04-08 23:07:34,597 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-10
2026-04-08 23:07:34,626 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-21
2026-04-08 23:07:34,627 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-19
2026-04-08 23:07:34,627 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-33
2026-04-08 23:07:34,628 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-16
2026-04-08 23:07:34,628 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-28
2026-04-08 23:07:34,641 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-50
2026-04-08 23:07:34,642 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-1
2026-04-08 23:07:34,656 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-29
2026-04-08 23:07:34,656 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-37
2026-04-08 23:07:34,657 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-6
2026-04-08 23:07:34,658 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-26
2026-04-08 23:07:34,672 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-25
2026-04-08 23:07:34,672 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-46
2026-04-08 23:07:34,672 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-38
2026-04-08 23:07:34,673 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-4
2026-04-08 23:07:34,673 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-5
2026-04-08 23:07:34,673 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-22
2026-04-08 23:07:34,687 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-30
2026-04-08 23:07:34,687 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-42
2026-04-08 23:07:34,687 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-2
2026-04-08 23:07:34,689 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-17
2026-04-08 23:07:34,689 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-36
2026-04-08 23:07:34,689 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-41
2026-04-08 23:07:34,689 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-8
2026-04-08 23:07:34,690 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-11
2026-04-08 23:07:34,690 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-34
2026-04-08 23:07:34,703 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-18
2026-04-08 23:07:34,704 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-9
2026-04-08 23:07:34,705 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-43
2026-04-08 23:07:34,706 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-12
2026-04-08 23:07:34,706 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-15
2026-04-08 23:07:34,707 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-40
2026-04-08 23:07:34,707 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-47
2026-04-08 23:07:34,707 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-31
2026-04-08 23:07:34,707 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-49
2026-04-08 23:07:34,707 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-35
2026-04-08 23:07:34,707 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-23
2026-04-08 23:07:34,708 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-32
2026-04-08 23:07:34,749 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-7
2026-04-08 23:07:34,764 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-20
2026-04-08 23:07:34,765 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-3
2026-04-08 23:07:34,765 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-14
2026-04-08 23:07:34,765 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-39
2026-04-08 23:07:34,766 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-48
2026-04-08 23:07:34,811 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-44
2026-04-08 23:07:34,814 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: 稳定性测试 - 50 并发 - 5 分钟 1-45
2026-04-08 23:07:34,814 INFO o.a.j.t.JMeterThread: Thread finished: 稳定性测试 - 50 并发 - 5 分钟 1-45
2026-04-08 23:07:34,815 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-04-08 23:07:34,815 INFO o.a.j.s.FileServer: Close: data/videos.csv
2026-04-08 23:07:34,815 INFO o.a.j.s.FileServer: Close: data/users.csv
2026-04-08 23:07:34,817 INFO o.a.j.r.Summariser: summary +   1107 in 00:00:05 =  230.6/s Avg:     6 Min:     3 Max:    19 Err:     0 (0.00%) Active: 0 Started: 50 Finished: 50
2026-04-08 23:07:34,817 INFO o.a.j.r.Summariser: summary =  66167 in 00:05:00 =  220.5/s Avg:     6 Min:     2 Max:   146 Err:     0 (0.00%)